tutorials/oneraM6Turb/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    
    wing
    {
        type            wall;
        physicalType    wall;
        inGroups        1(wall);
        nFaces          4608;
        startFace       873216;
    }
    symm
    {
        type            symmetryPlane;
        inGroups        1(symmetryPlane);
        nFaces          9216;
        startFace       877824;
    }
    farfield
    {
        type            patch;
        nFaces          9216;
        startFace       887040;
    }
)

// ************************************************************************* //
