tutorials/oneraM6Turb/0/nuTilda
/*-----------------------------------------------------------------------------------------*\
| =========                 |                                                               |
| \\      /  F ield         | rhoDST: Block-coupled solver for compressible flows           |
|  \\    /   O peration     |                                                               |
|   \\  /    A nd           | Copyright (C) 2020 Design and Simulation Tech. Inc. (DSTECH)  |
|    \\/     M anipulation  | Website:  http://www.dstechno.net/                            |
\*-----------------------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nuTilda;
}
// *************************************************************************************** //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 5.9e-05;

boundaryField
{
    wing
    {
        type            fixedValue;
        value           uniform 0;
    }

    farfield
    {
        type            inletOutlet;
        value           $internalField;
        inletValue      $internalField;
    }

    symm
    {
        type            symmetryPlane;
    }
}

// *************************************************************************************** //
