tutorials/oneraM6Turb/system/fvSchemes
/*-----------------------------------------------------------------------------------------*\
| =========                 |                                                               |
| \\      /  F ield         | rhoDST: Block-coupled solver for compressible flows           |
|  \\    /   O peration     |                                                               |
|   \\  /    A nd           | Copyright (C) 2020 Design and Simulation Tech. Inc. (DSTECH)  |
|    \\/     M anipulation  | Website:  http://www.dstechno.net/                            |
\*-----------------------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


ddtSchemes
{
    default         steadyStateDST;// steadyStateDST or Euler
}

gradSchemes
{
    default         	faceLimited Gauss linear 0.1;
    grad(nuTilda)   	cellLimited Gauss linear 1;
}

divSchemes
{
    default         	none;
    div(tauMC)      	Gauss linear;
    div(phi,k)          Gauss upwind;
    div(phi,epsilon)    Gauss upwind;
    div(phi,e)          Gauss upwind;
    div(phi,nuTilda)    Gauss linearUpwind grad(nuTilda);
}

laplacianSchemes
{
    default                     Gauss linear limited 0.33;
}

interpolationSchemes
{
    default         linear;
    reconstruct(rho) OSPRE;
    reconstruct(U)  OSPREV;
    reconstruct(T)  OSPRE;
}

snGradSchemes
{
    default         corrected;
}

wallDist
{
    method meshWave;
}

// ************************************************************************* //
