tutorials/oneraM6Turb/Allrun
#!/bin/sh
cd ${0%/*} || exit 1    # Run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

# Get application directory

runApplication decomposePar
runParallel rhoDST 8

runApplication reconstructPar 

rm -rf processor*

#------------------------------------------------------------------------------
